Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.GetFamilyInstanceId
Gets the Id of the fiting or accessory instance
Returns:
The element Id of the fiting or accessory instance.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.GetAllConnectorData
Gets the connector data of the pipe fitting or pipe accessory.
Remarks:
PipeFittingAndAccessoryConnectorData contains connector data which is needed to calculate coefficient.
such as width, height, diameter and flow.
Returns:
All connector data.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.GetEntity
Returns an Entity of the Schema of the serverGUID.
Remarks:
The Entity that is returned is a copy of the stored data (with copy-on-write optimization).
Modifying it is allowed (even with restricted write), but to save your changes you must call SetEntity.
Returns:
The Entity.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.FluidDensity
The fluid density of the pipe fitting or pipe accessory, Units: (kg/ft³).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.FluidViscosity
The fluid dynamic viscosity of the pipe fitting or pipe accessory, Units: (kg/(ft·s)).
Since:
2014

Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.Origin
The origin position of the pipe fitting or pipe accessory.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.SystemClassification
The system classification of the pipe fitting or pipe accessory.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.BehaviorType
The behavior type of the pipe fitting or pipe accessory.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.PartType
The part type of the pipe fitting or pipe accessory.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData.ServerGUID
The GUID of the pipe fitting or pipe accessory.
Since:
2014

Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryData
The input data used by external servers for calculation of the pipe fitting and pipe accessory coefficient.
Remarks:
A FamilyInstance is the input data for the calculation,
and the result is coefficient for each connector.
Since:
2014